In [5]:
import pandas as pd
import numpy as np

In [6]:
data = np.array([[1, 2, 3], [4, 5, 6]])

df = pd.DataFrame(data, columns=['A', 'B', 'C'])

df

   A  B  C
0  1  2  3
1  4  5  6

In [7]:
df.to_csv('data.csv', index=False)

In [ ]:
data = {
    'name': ['John', 'Anna', 'Peter', 'Linda'],
    'age': [28, 24, 35, 32],
    'city': ['New York', 'Paris', 'Berlin', 'London']
}

df = pd.DataFrame(data)
df

In [11]:
ages = df["age"]

In [ ]:
df.age

In [ ]:
df.set_index["name", in]

# ROW INDEXING

In [15]:
df.loc[3]

name     Linda
age         32
city    London
Name: 3, dtype: object

In [24]:
df.iloc[1]

name     Anna
age        24
city    Paris
Name: 1, dtype: object

In [23]:
mask = df["age"] > 25
mask

0     True
1    False
2     True
3     True
Name: age, dtype: bool

In [25]:
df[mask]

    name  age      city
0   John   28  New York
2  Peter   35    Berlin
3  Linda   32    London

""" df.setindex("name")

# Pandas Data Cleaning

In [26]:
# Create a DataFrame by passing a numpy array, with a datetime index and labeled columns
data = [
    ['John', 28, 1.82],
    ['Anna', None, 1.65],
    ['Peter', 35, 1.76],
    ['John', 28, 1.82],
    ['Linda', 32, 1.79],
    ['Alice', 41, None],
    ['Carl', 29, 1.72],
]

df = pd.DataFrame(data, columns=['name', 'age', 'height'])
df = df.set_index("name")
df

        age  height
name
John   28.0    1.82
Anna    NaN    1.65
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Alice  41.0     NaN
Carl   29.0    1.72

In [27]:
df.isna()

         age  height
name
John   False   False
Anna    True   False
Peter  False   False
John   False   False
Linda  False   False
Alice  False    True
Carl   False   False

In [28]:
df.isna().sum()

age       1
height    1
dtype: int64

In [29]:
df.dropna()

        age  height
name
John   28.0    1.82
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Carl   29.0    1.72

OJO al inplace

In [31]:
clean_df = df.dropna()
clean_df

        age  height
name
John   28.0    1.82
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Carl   29.0    1.72

In [33]:
zero_df = df.fillna(0)
zero_df

        age  height
name
John   28.0    1.82
Anna    0.0    1.65
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Alice  41.0    0.00
Carl   29.0    1.72

In [ ]:
zero_df = df.fillna(mean)
zero_df

In [34]:
df.duplicated

<bound method DataFrame.duplicated of         age  height
name
John   28.0    1.82
Anna    NaN    1.65
Peter  35.0    1.76
John   28.0    1.82
Linda  32.0    1.79
Alice  41.0     NaN
Carl   29.0    1.72>